#+TITLE: Exercism for Elisp
:PROPERTIES:
#+STARTUP: nologdone
#+PROPERTY: header-args:shell :tangle exercism.sh
#+TODO: TODO(t) | DONE(d)
:END:

Dabbling with Emacs Lisp (elisp).

Solutions for the [[https://exercism.org/tracks/emacs-lisp][Exercism Emacs Lisp Track]]

** Configure

To configure exercism, the following input is required:
- *token* - obtained from exercism web page under profile settings. Save this string to file, and specify file location in input var for the script below.
- *workspace folder* - folder exercism will user for it tracks/exercises

Run below to create workspace with token.

#+begin_src shell :var TOKEN_FILE="my_token" :results output
TOKEN=$(cat $TOKEN_FILE)
mkdir exercism
exercism configure --token=$TOKEN -w "$(pwd)/exercism" 2>&1
echo "$(pwd)/exercism"
#+end_src

Get the workspace path
#+NAME: exercism-workspace
#+begin_src shell :cache yes
exercism workspace
#+end_src

#+RESULTS[763e1c1a27d23699f2b4113bdaf7f63a89f37870]: exercism-workspace
: ~/code/elisp/exercism

#+NAME: exercism-track
: emacs-lisp

** Acronym
Convert a long phrase to its acronym.
#+begin_src shell
exercism download -t emacs-lisp -e acronym
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/acronym

[[https://exercism.org/tracks/emacs-lisp/exercises/acronym][Overview]]

** Allergies
:PROPERTIES:
:ID:       296cba6c-b148-4e59-a8d0-dd45b16451be
:END:
Given a person's allergy score, determine whether or not they're allergic to a given item, and their full list of allergies.
#+begin_src shell
exercism download -t emacs-lisp -e allergies
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/allergies

[[https://exercism.org/tracks/emacs-lisp/exercises/allergies][Overview]]

** All Your Base
Convert a number, represented as a sequence of digits in one base, to any other base.
#+begin_src shell
exercism download -t emacs-lisp -e all-your-base
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/all-your-base

[[https://exercism.org/tracks/emacs-lisp/exercises/all-your-base][Overview]]

*** Start

#+begin_src shell
exercism download -t emacs-lisp -e anagram
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/anagram

[[https://exercism.org/tracks/emacs-lisp/exercises/anagram][Overview]]

*** Tests
#+begin_src shell :exports both :results output drawer :var workspace=exercism-workspace track=exercism-track
cd ${workspace}/${track}/anagram
emacs -batch -l ert -l anagram-test.el -f ert-run-tests-batch-and-exit 2>&1
#+end_src

#+RESULTS:
:results:
Loading ~/code/elisp/exercism/emacs-lisp/anagram/anagram.el (source)...
Running 8 tests (2022-12-27 13:54:19+1100, selector ‘t’)
   passed  1/8  case-insensitive-anagrams (0.000119 sec)
   passed  2/8  detect-anagram (0.000086 sec)
   passed  3/8  detect-simple-anagram (0.000083 sec)
   passed  4/8  does-not-confuse-different-duplicates (0.000073 sec)
   passed  5/8  eliminate-anagram-subsets (0.000078 sec)
   passed  6/8  multiple-anagrams (0.000092 sec)
   passed  7/8  no-matches (0.000092 sec)
   passed  8/8  word-is-not-own-anagram (0.000066 sec)

Ran 8 tests, 8 results as expected, 0 unexpected (2022-12-27 13:54:19+1100, 0.001088 sec)

:end:

#+begin_src elisp :tangle exercism/emacs-lisp/anagram/anagram-test.el
;;; anagram-test.el --- Tests for Anagram (exercism)

;;; Commentary:

;;; Code:

(load-file "anagram.el")

(ert-deftest no-matches ()
  (should (equal '() (anagrams-for
                      "diaper"
                      '("hello" "world" "zombies" "pants")))))

(ert-deftest detect-simple-anagram ()
  (should (equal '("tan") (anagrams-for
                           "ant"
                           '("tan" "stand" "at")))))

(ert-deftest does-not-confuse-different-duplicates ()
  (should (equal '() (anagrams-for
                      "galea"
                      '("eagle")))))

(ert-deftest eliminate-anagram-subsets ()
  (should (equal '() (anagrams-for
                      "good"
                      '("dog" "goody")))))

(ert-deftest detect-anagram ()
  (should (equal '("inlets") (anagrams-for
                              "listen"
                              '("enlists" "google" "inlets" "banana")))))

(ert-deftest multiple-anagrams ()
  (should (equal '("gallery" "regally" "largely")
                 (anagrams-for
                  "allergy"
                  '("gallery" "ballerina" "regally" "clergy" "largely" "leading")))))

(ert-deftest case-insensitive-anagrams ()
    (should (equal '("Carthorse")
                   (anagrams-for
                    "Orchestra"
                    '("cashregister" "Carthorse" "radishes")))))

(ert-deftest word-is-not-own-anagram ()
  (should (equal '()
                 (anagrams-for
                  "banana"
                  '("banana")))))

(ert-deftest word-is-not-own-anagram-if-letter-case-is-partially-different ()
  (should (equal '()
                 (anagrams-for
                  "BANANA"
                  '("Banana")))))

(ert-deftest word-is-not-own-anagram-if-letter-case-is-completely-different ()
  (should (equal '()
                 (anagrams-for
                  "BANANA"
                  '("banana")))))

(ert-deftest words-other-than-themselves-can-be-anagrams()
  (should (equal '("Silent")
                 (anagrams-for
                  "LISTEN"
                  '("Listen" "Silent" "LISTEN")))))

(provide 'anagram-test)
;;; anagram-test.el ends here

#+end_src

** Armstrong Numbers
Determine if a number is an Armstrong number.
#+begin_src shell
exercism download -t emacs-lisp -e armstrong-numbers
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/armstrong-numbers

[[https://exercism.org/tracks/emacs-lisp/exercises/armstrong-numbers][Overview]]

** Atbash Cipher
Create an implementation of the atbash cipher, an ancient encryption system created in the Middle East.
#+begin_src shell
exercism download -t emacs-lisp -e atbash-cipher
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/atbash-cipher

[[https://exercism.org/tracks/emacs-lisp/exercises/atbash-cipher][Overview]]

*** Start
#+begin_src shell
exercism download -t emacs-lisp -e bob
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/bob

[[https://exercism.org/tracks/emacs-lisp/exercises/bob][Overview]]

** Crypto Square
Implement the classic method for composing secret messages called a square code.
#+begin_src shell
exercism download -t emacs-lisp -e crypto-square
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/crypto-square

[[https://exercism.org/tracks/emacs-lisp/exercises/crypto-square][Overview]]

*** Start
#+begin_src shell
exercism download -t emacs-lisp -e difference-of-squares
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/difference-of-squares

[[https://exercism.org/tracks/emacs-lisp/exercises/difference-of-squares][Overview]]

** ETL
We are going to do the `Transform` step of an Extract-Transform-Load.
#+begin_src shell
exercism download -t emacs-lisp -e etl
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/etl

[[https://exercism.org/tracks/emacs-lisp/exercises/etl][Overview]]

*** Start
#+begin_src shell
exercism download -t emacs-lisp -e gigasecond
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/gigasecond

[[https://exercism.org/tracks/emacs-lisp/exercises/gigasecond][Overview]]

** Grains
Calculate the number of grains of wheat on a chessboard given that the number on each square doubles.
#+begin_src shell
exercism download -t emacs-lisp -e grains
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/grains

[[https://exercism.org/tracks/emacs-lisp/exercises/grains][Overview]]

*** Start
#+begin_src shell
exercism download -t emacs-lisp -e hamming
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/hamming

[[https://exercism.org/tracks/emacs-lisp/exercises/hamming][Overview]]

*** Start
#+begin_src shell :var exname="hello-world"
exercism download -t emacs-lisp -e ${exname}
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/hello-world

[[https://exercism.org/tracks/emacs-lisp/exercises/hello-world][Overview]]

*** Tests
#+begin_src shell :exports both :results output drawer :var workspace=exercism-workspace track=exercism-track
cd ${workspace}/${track}/hello-world
emacs -batch -l ert -l hello-world-test.el -f ert-run-tests-batch-and-exit 2>&1
#+end_src

#+RESULTS:
:results:
Loading ~/code/elisp/exercism/emacs-lisp/hello-world/hello-world.el (source)...
Running 1 tests (2022-12-27 09:55:08+1100, selector ‘t’)
   passed  1/1  hello-world-test (0.000094 sec)

Ran 1 tests, 1 results as expected, 0 unexpected (2022-12-27 09:55:08+1100, 0.000198 sec)

:end:

#+begin_src elisp :tangle exercism/emacs-lisp/hello-world/hello-world-test.el
;;; hello-world-test.el --- Tests for Hello World (exercism)  -*- lexical-binding: t; -*-

;;; Commentary:
;; Common test data version: 1.1.0 be3ae66

;;; Code:

(load-file "hello-world.el")
(declare-function hello "hello-world.el")

(ert-deftest hello-world-test ()
  (should (string= (hello) "Hello, World!")))

(provide 'hello-world-test)

;;; hello-world-test.el ends here

#+end_src

*** Start
#+begin_src shell
exercism download -t emacs-lisp -e leap
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/leap

[[https://exercism.org/tracks/emacs-lisp/exercises/leap][Overview]]

*** Tests
#+begin_src shell :exports both :results output drawer :var workspace=exercism-workspace track=exercism-track
cd ${workspace}/${track}/leap
emacs -batch -l ert -l leap-test.el -f ert-run-tests-batch-and-exit 2>&1
#+end_src

#+RESULTS:
:results:
Loading ~/code/elisp/exercism/emacs-lisp/leap/leap.el (source)...
Running 5 tests (2022-12-27 09:53:11+1100, selector ‘t’)
   passed  1/5  any-old-year (0.000298 sec)
   passed  2/5  century (0.000062 sec)
   passed  3/5  exceptional-century (0.000051 sec)
   passed  4/5  non-leap-even-year (0.000089 sec)
   passed  5/5  vanilla-leap-year (0.000067 sec)

Ran 5 tests, 5 results as expected, 0 unexpected (2022-12-27 09:53:11+1100, 0.000819 sec)

:end:

#+begin_src elisp :tangle exercism/emacs-lisp/leap/leap-test.el
;;; leap-test.el --- Tests for Leap exercise (exercism)

;;; Commentary:

;;; Code:
(load-file "leap.el")

(ert-deftest vanilla-leap-year ()
  (should (leap-year-p 1996)))

(ert-deftest any-old-year ()
  (should-not (leap-year-p 1997)))

(ert-deftest non-leap-even-year ()
  (should-not (leap-year-p 1997)))

(ert-deftest century ()
  (should-not (leap-year-p 1900)))

(ert-deftest exceptional-century ()
  (should (leap-year-p 2000)))

(provide 'leap-test)
;;; leap-test.el ends here

#+end_src

** List Ops
Implement basic list operations.
#+begin_src shell
exercism download -t emacs-lisp -e list-ops
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/list-ops
[[https://exercism.org/tracks/emacs-lisp/exercises/list-ops][Overview]]

** Luhn
Given a number determine whether or not it is valid per the Luhn formula.
#+begin_src shell
exercism download -t emacs-lisp -e luhn
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/luhn

[[https://exercism.org/tracks/emacs-lisp/exercises/luhn][Overview]]

** Nucleotide Count
Given a DNA string, compute how many times each nucleotide occurs in the string.
#+begin_src shell
exercism download -t emacs-lisp -e nucleotide-count
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/nucleotide-count

[[https://exercism.org/tracks/emacs-lisp/exercises/nucleotide-count][Overview]]

** Pangram
Determine if a sentence is a pangram.
#+begin_src shell
exercism download -t emacs-lisp -e pangram
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/pangram

[[https://exercism.org/tracks/emacs-lisp/exercises/pangram][Overview]]

** Perfect Numbers
Determine if a number is perfect, abundant, or deficient based on Nicomachus' (60-120 CE) classification scheme for positive integers.
#+begin_src shell
exercism download -t emacs-lisp -e perfect-numbers
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/perfect-numbers

[[https://exercism.org/tracks/emacs-lisp/exercises/perfect-numbers][Overview]]

** Phone Number
Clean up user-entered phone numbers so that they can be sent SMS messages.
#+begin_src shell
exercism download -t emacs-lisp -e phone-number
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/phone-number

[[https://exercism.org/tracks/emacs-lisp/exercises/phone-number][Overview]]

** Raindrops
Convert a number to a string, the content of which depends on the number's factors.
#+begin_src shell
exercism download -t emacs-lisp -e raindrops
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/raindrops

[[https://exercism.org/tracks/emacs-lisp/exercises/raindrops][Overview]]

*** Start
#+begin_src shell
exercism download -t emacs-lisp -e rna-transcription
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/rna-transcription

[[https://exercism.org/tracks/emacs-lisp/exercises/rna-transcription][Overview]]

** Robot Name
Manage robot factory settings.
#+begin_src shell
exercism download -t emacs-lisp -e robot-name
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/robot-name

[[https://exercism.org/tracks/emacs-lisp/exercises/robot-name][Overview]]

*** Start

#+begin_src shell
exercism download -t emacs-lisp -e roman-numerals
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/roman-numerals

[[https://exercism.org/tracks/emacs-lisp/exercises/roman-numerals][Overview]]

*** Tests
#+begin_src shell :exports both :results output drawer :var workspace=exercism-workspace track=exercism-track
cd ${workspace}/${track}/roman-numerals
emacs -batch -l ert -l roman-numerals-test.el -f ert-run-tests-batch-and-exit 2>&1
#+end_src

#+RESULTS:
:results:
Loading ~/code/elisp/exercism/emacs-lisp/roman-numerals/roman-numerals.el (source)...
Running 18 tests (2022-12-27 09:54:11+1100, selector ‘t’)
   passed   1/18  to-roman-1 (0.000098 sec)
   passed   2/18  to-roman-1024 (0.000061 sec)
   passed   3/18  to-roman-141 (0.000054 sec)
   passed   4/18  to-roman-163 (0.000071 sec)
   passed   5/18  to-roman-2 (0.000070 sec)
   passed   6/18  to-roman-27 (0.000059 sec)
   passed   7/18  to-roman-3 (0.000038 sec)
   passed   8/18  to-roman-3000 (0.000041 sec)
   passed   9/18  to-roman-4 (0.000040 sec)
   passed  10/18  to-roman-402 (0.000041 sec)
   passed  11/18  to-roman-48 (0.000036 sec)
   passed  12/18  to-roman-5 (0.000040 sec)
   passed  13/18  to-roman-575 (0.000040 sec)
   passed  14/18  to-roman-59 (0.000040 sec)
   passed  15/18  to-roman-6 (0.000041 sec)
   passed  16/18  to-roman-9 (0.000037 sec)
   passed  17/18  to-roman-911 (0.000041 sec)
   passed  18/18  to-roman-93 (0.000066 sec)

Ran 18 tests, 18 results as expected, 0 unexpected (2022-12-27 09:54:11+1100, 0.001463 sec)

:end:

#+begin_src elisp :tangle exercism/emacs-lisp/roman-numerals/roman-numerals-test.el
;;; roman-numerals-test.el --- Tests for roman-numerals (exercism)

;;; Commentary:

;;; Code:

(load-file "roman-numerals.el")

(ert-deftest to-roman-1 ()
  (should (equal (to-roman 1) "I")))

(ert-deftest to-roman-2 ()
  (should (equal (to-roman 2) "II")))

(ert-deftest to-roman-3 ()
  (should (equal (to-roman 3) "III")))

(ert-deftest to-roman-4 ()
  (should (equal (to-roman 4) "IV")))

(ert-deftest to-roman-5 ()
  (should (equal (to-roman 5) "V")))

(ert-deftest to-roman-6 ()
  (should (equal (to-roman 6) "VI")))

(ert-deftest to-roman-9 ()
  (should (equal (to-roman 9) "IX")))

(ert-deftest to-roman-27 ()
  (should (equal (to-roman 27) "XXVII")))

(ert-deftest to-roman-48 ()
  (should (equal (to-roman 48) "XLVIII")))

(ert-deftest to-roman-59 ()
  (should (equal (to-roman 59) "LIX")))

(ert-deftest to-roman-93 ()
  (should (equal (to-roman 93) "XCIII")))

(ert-deftest to-roman-141 ()
  (should (equal (to-roman 141) "CXLI")))

(ert-deftest to-roman-163 ()
  (should (equal (to-roman 163) "CLXIII")))

(ert-deftest to-roman-402 ()
  (should (equal (to-roman 402) "CDII")))

(ert-deftest to-roman-575 ()
  (should (equal (to-roman 575) "DLXXV")))

(ert-deftest to-roman-911 ()
  (should (equal (to-roman 911) "CMXI")))

(ert-deftest to-roman-1024 ()
  (should (equal (to-roman 1024) "MXXIV")))

(ert-deftest to-roman-3000 ()
  (should (equal (to-roman 3000) "MMM")))

(provide 'roman-numerals)
;;; roman-numerals-test.el ends here

#+end_src

** Run-Length Encoding
Implement run-length encoding and decoding.
#+begin_src shell
exercism download -t emacs-lisp -e run-length-encoding
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/run-length-encoding
[[https://exercism.org/tracks/emacs-lisp/exercises/run-length-encoding][Overview]]

*** Start
#+begin_src shell
exercism download -t emacs-lisp -e sublist
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/sublist

[[https://exercism.org/tracks/emacs-lisp/exercises/sublist][Overview]]

** Trinary
Convert a trinary number, represented as a string (e.g. '102012'), to its decimal equivalent using first principles.
#+begin_src shell
exercism download -t emacs-lisp -e trinary
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/trinary

[[https://exercism.org/tracks/emacs-lisp/exercises/trinary][Overview]]

*** Start
#+begin_src shell
exercism download -t emacs-lisp -e two-fer
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/two-fer

[[https://exercism.org/tracks/emacs-lisp/exercises/two-fer][Overview]]

*** Tests
#+begin_src shell :exports both :results output drawer :var workspace=exercism-workspace track=exercism-track
cd ${workspace}/${track}/two-fer
emacs -batch -l ert -l two-fer-test.el -f ert-run-tests-batch-and-exit 2>&1
#+end_src

#+RESULTS:
:results:
Loading ~/code/elisp/exercism/emacs-lisp/two-fer/two-fer.el (source)...
Running 3 tests (2022-12-27 10:21:30+1100, selector ‘t’)
   passed  1/3  a-name-given (0.000108 sec)
   passed  2/3  another-name-given (0.000061 sec)
   passed  3/3  no-name-given (0.000051 sec)

Ran 3 tests, 3 results as expected, 0 unexpected (2022-12-27 10:21:30+1100, 0.000398 sec)

:end:


#+begin_src elisp :tangle exercism/emacs-lisp/two-fer/two-fer-test.el

;;; two-fer-test.el --- Tests for Two-fer (exercism)

;;; Commentary:
;; Common test data version: 1.2.0 4fc1acb

;;; Code:

(load-file "two-fer.el")

(ert-deftest no-name-given ()
  (should (string= (two-fer) "One for you, one for me.")))

(ert-deftest a-name-given ()
  (should (string= (two-fer "Alice") "One for Alice, one for me.")))

(ert-deftest another-name-given ()
  (should (string= (two-fer "Bob") "One for Bob, one for me.")))

(provide 'two-fer-test)

;;; two-fer-test.el ends here

#+end_src

*** Start
#+begin_src shell
exercism download -t emacs-lisp -e word-count
#+end_src

#+RESULTS:
: ~/code/elisp/exercism/emacs-lisp/word-count

[[https://exercism.org/tracks/emacs-lisp/exercises/word-count][Overview]]

